Repository: seppius-xbmc-repo/ru
Catalog: pvr.p2pproxy/resources/language/*/strings.po
Languages: dutch, german

# Addon Summary
source: XBMC PVR addon for IPTV support. https://github.com/afedchin/xbmc-addon-p2pproxy/wiki/IPTV-Simple-Home
dutch: XBMC PVR addon voor IPTV support. https://github.com/afedchin/xbmc-addon-p2pproxy/wiki/IPTV-Simple-Home

# Addon Description
source: IPTV Simple PVR Client support m3u playlists, streaming of Live TV for multicast/unicast sources, listening to Radio channels and EPG.
dutch: IPTV Simple PVR Client ondersteunt m3u afspeellijsten, streaming of Live TV voor multicast/unicast bronnen, luisteren naar Radio kanalen en EPG.

# Addon Disclaimer
source: This is unstable software! The authors are in no way responsible for failed playings, incorrect EPG times, wasted hours, or any other undesirable effects.
dutch: Dit is onstabiele software! De auteurs zijn op geen enkele manier aansprakelijk voor falen in afspelen, incorrecte EPG tijden, verspilde uren, of wel ongewenst effect dan ook.

# #30000
source: Location
dutch: Locatie
german: Standort

# #30001
source: Local Path (include Local Network)
dutch: Lokaal Pad (inclusied Lokale Netwerk)
german: Lokaler Pfad (inklusive Lokalem Netzwerk)

# #30002
source: Remote Path (Internet address)
dutch: Extern Pad (Internet adres)
german: Entfernter Pfad (Internetadresse)

# #30010
source: Play List Settings
dutch: Afspeellijst instellingen

# #30011
source: M3U Play List Path
dutch: M3U Afspeellijst Pad
german: Pfad zur M3U Wiedergabeliste

# #30012
source: M3U Play List URL
dutch: M3U Afspeellijst URL
german: URL zur M3U Wiedergabeliste

# #30020
source: EPG Settings
dutch: EPG Instellingen
german: EPG Einstellungen

# #30021
source: XMLTV Path
dutch: XMLTV Pad
german: XMLTV Pfad

# #30023
source: Apply Time Shift To All Channels
dutch: Stel Time Shift in voor alle kanalen
german: TimeShift auf alle Kan√§le anwenden

# #30024
source: EPG Time Shift (hours)
dutch: EPG Time Shift (uren)
german: EPG TimeShift

# #30030
source: Channels Logos
dutch: Kanalen Logo's
german: Kanal-Logos

# #30031
source: Channels Logos Folder
dutch: Kanalen Logo's Folder
german: Kanal-Logo-Ordner

# #30010
source: General
german: Allgemein

# #30013
source: Numbering channels starts at
german: Kanalnummerierung beginnt mit
