# -*- coding: utf-8 -*-
#genre%5D/ GenreList ,2/
GenreList=[
(0 , "Все" ),
(1750 , "аниме" ),
(22 , "биография" ),
(3 , "боевик" ),
(13 , "вестерн" ),
(19 , "военный" ),
(17 , "детектив" ),
(456 , "детский" ),
(20 , "для взрослых" ),
(12 , "документальный" ),
(8 , "драма" ),
(27 , "игра" ),
(23 , "история" ),
(6 , "комедия" ),
(1747 , "концерт" ),
(15 , "короткометражка" ),
(16 , "криминал" ),
(7 , "мелодрама" ),
(21 , "музыка" ),
(14 , "мультфильм" ),
(9 , "мюзикл" ),
(28 , "новости" ),
(10 , "приключения" ),
(25 , "реальное ТВ" ),
(11 , "семейный" ),
(999 , "сериал" ),
(24 , "спорт" ),
(26 , "ток-шоу" ),
(4 , "триллер" ),
(1 , "ужасы" ),
(2 , "фантастика" ),
(18 , "фильм-нуар" ),
(5 , "фэнтези" )
]
#country%5D/CantryList/
CantryList=[
(0 , "Все" ),
(2 , "Россия" ),
(1 , "США" ),
(13 , "СССР" ),
(25 , "Австралия" ),
(57 , "Австрия" ),
(24 , "Аргентина"),
(69 , "Беларусь"),
(41 , "Бельгия"),
(10 , "Бразилия"),
(11 , "Великобритания"),
(3 , "Германия"),
(28 , "Гонконг"),
(61 , "Грузия"),
(4 , "Дания"),
(101 , "Египет"),
(42 , "Израиль"),
(29 , "Индия"),
(38 , "Ирландия"),
(15 , "Испания"),
(14 , "Италия"),
(6 , "Канада"),
(31 , "Китай"),
(156 , "Корея"),
(125 , "Лихтенштейн"),
(17 , "Мексика"),
(12 , "Нидерланды"),
(33 , "Норвегия"),
(32 , "Польша"),
(36 , "Португалия"),
(44 , "Таиланд"),
(68 , "Турция"),
(62 , "Украина"),
(7 , "Финляндия"),
(8 , "Франция"),
(16 , "Чехословакия"),
(51 , "Чили"),
(21 , "Швейцария"),
(5 , "Швеция"),
(53 , "Эстония"),
(9 , "Япония" )
]

#years%5D/2001:2012/
YearList=[
('0', "Все"),
('2010', "2010-е"),
('2000', "2000-е"),
('1990', "1990-е"),
('1980', "1980-е"),
('1970', "1970-е"),
('1960', "1960-е"),
('1950', "1950-е"),
('1940', "1940-е"),
('1930', "1930-е"),
('1920', "1920-е"),
('1910', "1910-е"),
('1900', "1900-е"),
('1890', "1890-е")
]

#Рейтинг MPAA:
MPAAList=[
('G', "G"),
('PG', "PG"),
('PG-13', "PG-13"),
('R', "R"),
('NC-17', "NC-17"),
('C', "C"),
('GP', "GP")
]

OldList=[
('','любой'),
('0+','0+'),
('6+','6+'),
('12+','12+'),
('16+','16+'),
('18+','18+')
]

SortList=[
("order/rating", "рейтингу КиноПоиска"),
("order/ex_rating", "рейтингу IMDb"),
("order/review_procent", "рейтингу рецензий"),
("order/tomat_rating", "рейтингу кинокритиков"),
("order/year", "году"),
("order/name", "названию"),
("order/original", "оригинальному названию"),
("order/rus", "сборам в РФ"),
("order/box", "сборам в США"),
("order/premiere", "премьере в мире"),
("order/premiere_ru", "премьере в РФ"),
("order/budget", "бюджету"),
("order/num_vote", "количеству оценок"),
("order/runtime", "времени")
]

RatingList=[
('','любой'),
('9','> 9'),
('8','> 8'),
('7','> 7'),
('6','> 6'),
('5','> 5'),
('4','> 4'),
('3','> 3'),
('2','> 2'),
('1','> 1'),
('0','> 0')
]


#is_dvd%5D/on/
TypeList=[
('all', 	"Вce"),
('is_film', 	"фильмы"),
('is_serial', 	"сериалы"),
('is_mult', 	"мультфильмы"),
('is_dvd',		"есть на DVD")
]

#/order/rating/
SortListold=[
('rating', "рейтингу Кинопоиска"),
('ex_rating', "рейтингу IMDb"),
('review_procent', "рейтингу рецензий"),
('tomat_rating', "рейтингу критиков"),
('name', "имени"),
('rus', "сборам в РФ"),
('box', "сборам в США"),
('budget', "бюджету")
]